insert into sex(sex,sex_id)
values 
('여성' ,'S_01'),
('남성' ,'S_02');

insert into HiSTORYDISEASE(HiSTORYDISEASE,HiSTORYDISEASE_ID)
values
('고혈압','H_01'),
('당뇨','H_02'),
('심장병','H_03'),
('천식','H_04'),
('알레르기없음','H_05');

insert into ALLERGIES(ALLERGIES,ALLERGIES_ID)
values 
('해산물','A_01'),
('우유','A_02'),
('아무것도 없음','A_03'),
('계란','A_04');


insert into PAYMENT(PAYMENT,PAYMENT_ID)
values 
('신용카드','P_01'),
('현금','P_02');


INSERT INTO membersinfor
(MEMBER_ID, NAME, ID, PASSWORD, BIRTHDATE, AGE, SEX_ID, ADDRESS, PHONE, HISTORYDISEASE_ID, ALLERGIES_ID, REGISTRATIONDATE, EMAIL, PAYMENT_ID)
VALUES
    ('MEMB_01', '김영수', 'kimys', '123456', '1990-01-15', 32, 'S_02', '서울시 강남구', '010-1234-5678', 'H_01', 'A_01', '2022-01-01', 'kimys@example.com', 'P_01'),
    ('MEMB_02', '이지현', 'eejh', 'abcdef', '1985-02-28', 37, 'S_01', '서울시 서대문구', '010-2345-6789', 'H_02', 'A_02', '2020-03-15', 'eejh@example.com', 'P_02'),
    ('MEMB_03', '박준호', 'parkjh', 'qazwsx', '1978-10-05', 43, 'S_02', '부산시 해운대구', '010-3456-7890', 'H_03', 'A_03', '2015-11-20', 'parkjh@example.com', 'P_01'),
    ('MEMB_04', '송지은', 'songje', '987654', '1993-06-20', 28, 'S_01', '대구시 동구', '010-4567-8901', 'H_04', 'A_04', '2019-02-28', 'songje@example.com', 'P_01'),
    ('MEMB_05', '최민준', 'choimj', 'qwerty', '2001-08-07', 21, 'S_02', '인천시 중구', '010-5678-9012', 'H_05', 'A_03', '2021-12-10', 'choimj@example.com', 'P_02'),
    ('MEMB_06', '정지현', 'jeongjh', '13579a', '1999-09-03', 24, 'S_01', '경기도 성남시', '010-6789-0123', 'H_01', 'A_03', '2020-10-05', 'jeongjh@example.com', 'P_01'),
    ('MEMB_07', '박성민', 'parksm', 'asdfgh', '1982-12-18', 39, 'S_02', '서울시 송파구', '010-7890-1234', 'H_02', 'A_02', '2017-06-20', 'parksm@example.com', 'P_02'),
    ('MEMB_08', '윤지수', 'yunjis', 'zxcvbn', '1997-12-30', 26, 'S_01', '대전시 서구', '010-8901-2345', 'H_05', 'A_03', '2023-02-15', 'yunjis@example.com', 'P_01'),
    ('MEMB_09', '김민준', 'kimmj', '123123', '1990-08-02', 33, 'S_02', '인천시 남동구', '010-9012-3456', 'H_01', 'A_04', '2018-04-05', 'kimmj@example.com', 'P_01'),
    ('MEMB_10', '이예진', 'eeyj', 'abcd1234', '1994-02-13', 29, 'S_01', '경기도 고양시', '010-0123-4567', 'H_04', 'A_03', '2014-01-28', 'eeyj@example.com', 'P_02'),
    ('MEMB_11', '박준서', 'parkjs', 'qwer1234', '1986-01-05', 37, 'S_02', '서울시 강서구', '010-3456-7890', 'H_03', 'A_02', '2011-05-20', 'parkjs@example.com', 'P_01'),
    ('MEMB_12', '김서연', 'kimsy', '98765432', '1995-12-10', 28, 'S_01', '부산시 사하구', '010-5678-9012', 'H_05', 'A_01', '2022-07-18', 'kimsy@example.com', 'P_02'),
    ('MEMB_13', '정예준', 'jeongyj', 'qwertyuiop', '1998-09-24', 24, 'S_02', '대구시 수성구', '010-6789-0123', 'H_01', 'A_04', '2021-09-10', 'jeongyj@example.com', 'P_01'),
    ('MEMB_14', '송지현', 'songjh', '12345678', '1982-08-07', 41, 'S_01', '인천시 남구', '010-7890-1234', 'H_02', 'A_03', '2018-02-14', 'songjh@example.com', 'P_02'),
    ('MEMB_15', '최서윤', 'choisy', 'asdfghjkl', '1993-03-30', 29, 'S_01', '경기도 성남시', '010-8901-2345', 'H_04', 'A_02', '2013-12-30', 'choisy@example.com', 'P_01'),
    ('MEMB_16', '윤준우', 'yunjw', 'zxcvbnm', '1989-10-17', 32, 'S_02', '서울시 송파구', '010-9012-3456', 'H_05', 'A_01', '2020-06-05', 'yunjw@example.com', 'P_01'),
    ('MEMB_17', '김민서', 'kimms', '12345678', '1992-10-25', 31, 'S_01', '대전시 중구', '010-0123-4567', 'H_01', 'A_03', '2018-07-10', 'kimms@example.com', 'P_02'),
    ('MEMB_18', '이영진', 'eeyj', 'abcd1234', '2001-03-14', 22, 'S_02', '인천시 서구', '010-3456-7890', 'H_03', 'A_02', '2019-04-18', 'eeyj@example.com', 'P_01'),
    ('MEMB_19', '박서준', 'parksj', 'qwer1234', '1990-01-10', 32, 'S_02', '경기도 부천시', '010-5678-9012', 'H_05', 'A_01', '2020-04-02', 'parksj@example.com', 'P_02'),
    ('MEMB_20', '김지윤', 'kimjy', '98765432', '1994-02-26', 29, 'S_01', '대구시 동구', '010-7890-1234', 'H_02', 'A_04', '2016-01-15', 'kimjy@example.com', 'P_01'),
    ('MEMB_21', '정지원', 'jeongjw', 'qwertyuiop', '1996-01-12', 27, 'S_02', '부산시 부산진구', '010-8901-2345', 'H_01', 'A_03', '2017-12-12', 'jeongjw@example.com', 'P_02'),
    ('MEMB_22', '이서진', 'eesj', '123456', '1999-05-23', 24, 'S_02', '서울시 서대문구', '010-9012-3456', 'H_03', 'A_02', '2021-05-05', 'eesj@example.com', 'P_01'),
    ('MEMB_23', '박민지', 'parkmj', 'asdfgh', '1998-02-28', 24, 'S_01', '인천시 중구', '010-0123-4567', 'H_05', 'A_03', '2023-10-30', 'parkmj@example.com', 'P_02'),
    ('MEMB_24', '김준서', 'kimjs', 'zxcvbn', '1985-06-20', 37, 'S_02', '경기도 고양시', '010-3456-7890', 'H_04', 'A_01', '2015-01-18', 'kimjs@example.com', 'P_01'),
    ('MEMB_25', '송서윤', 'songsy', '123123', '1994-01-09', 29, 'S_01', '대구시 달서구', '010-5678-9012', 'H_01', 'A_04', '2019-02-03', 'songsy@example.com', 'P_02'),
    ('MEMB_26', '최예은', 'choiye', 'abcdef', '1996-10-22', 27, 'S_01', '부산시 사하구', '010-7890-1234', 'H_02', 'A_03', '2018-03-08', 'choiye@example.com', 'P_01'),
    ('MEMB_27', '윤서준', 'yunsj', 'qazwsx', '1999-01-03', 24, 'S_02', '서울시 강남구', '010-8901-2345', 'H_05', 'A_01', '2021-07-22', 'yunsj@example.com', 'P_01'),
    ('MEMB_28', '김지율', 'kimjy', '98765432', '1992-09-14', 31, 'S_02', '인천시 남동구', '010-9012-3456', 'H_01', 'A_04', '2019-04-30', 'kimjy@example.com', 'P_01'),
    ('MEMB_29', '이정우', 'eejw', 'qwertyuiop', '1998-04-02', 24, 'S_02', '대전시 동구', '010-0123-4567', 'H_03', 'A_02', '2020-01-11', 'eejw@example.com', 'P_02'),
    ('MEMB_30', '박서율', 'parksy', 'asdfghjkl', '1995-09-26', 28, 'S_01', '경기도 성남시', '010-3456-7890', 'H_05', 'A_01', '2013-11-26', 'parksy@example.com', 'P_01');